Dlubal.RFEM5.CalculationNonlinearities
Parameters of nonlinearities

Dlubal.RFEM5.CalculationNonlinearities.SupportsAndElasticFoundations
Supports and elastic foundations

Dlubal.RFEM5.CalculationNonlinearities.MembersDueToType
Members due to member type

Dlubal.RFEM5.CalculationNonlinearities.Hinges
Member hinges, nodal releases

Dlubal.RFEM5.CalculationNonlinearities.MemberNonlinearities
Member nonlinearities

Dlubal.RFEM5.CalculationNonlinearities.ContactSolids
Solids of type Contact

Dlubal.RFEM5.CalculationNonlinearities.Materials
Materials with nonlinear model

Dlubal.RFEM5.CalculationNonlinearities.ThermalElasticMaterials
Isotropic thermal-elastic material model